nxp-mcuxpresso/mcux-soc-svd/MCXA186/MCXA186.xml
        <register>
          <name>BPEN0</name>
          <description>LCD Back Plane Enable register 0</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIN_0_BPEN</name>
              <description>LCD Pin 0 Back Plane Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_1_BPEN</name>
              <description>LCD Pin 1 Back Plane Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_2_BPEN</name>
              <description>LCD Pin 2 Back Plane Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_3_BPEN</name>
              <description>LCD Pin 3 Back Plane Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_4_BPEN</name>
              <description>LCD Pin 4 Back Plane Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_5_BPEN</name>
              <description>LCD Pin 5 Back Plane Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_6_BPEN</name>
              <description>LCD Pin 6 Back Plane Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_7_BPEN</name>
              <description>LCD Pin 7 Back Plane Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_8_BPEN</name>
              <description>LCD Pin 8 Back Plane Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_9_BPEN</name>
              <description>LCD Pin 9 Back Plane Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_10_BPEN</name>
              <description>LCD Pin 10 Back Plane Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_11_BPEN</name>
              <description>LCD Pin 11 Back Plane Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_12_BPEN</name>
              <description>LCD Pin 12 Back Plane Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_13_BPEN</name>
              <description>LCD Pin 13 Back Plane Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_14_BPEN</name>
              <description>LCD Pin 14 Back Plane Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_15_BPEN</name>
              <description>LCD Pin 15 Back Plane Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_16_BPEN</name>
              <description>LCD Pin 16 Back Plane Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_17_BPEN</name>
              <description>LCD Pin 17 Back Plane Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_18_BPEN</name>
              <description>LCD Pin 18 Back Plane Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_19_BPEN</name>
              <description>LCD Pin 19 Back Plane Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_20_BPEN</name>
              <description>LCD Pin 20 Back Plane Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_21_BPEN</name>
              <description>LCD Pin 21 Back Plane Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_22_BPEN</name>
              <description>LCD Pin 22 Back Plane Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_23_BPEN</name>
              <description>LCD Pin 23 Back Plane Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_24_BPEN</name>
              <description>LCD Pin 24 Back Plane Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_25_BPEN</name>
              <description>LCD Pin 25 Back Plane Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_26_BPEN</name>
              <description>LCD Pin 26 Back Plane Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_27_BPEN</name>
              <description>LCD Pin 27 Back Plane Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_28_BPEN</name>
              <description>LCD Pin 28 Back Plane Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_29_BPEN</name>
              <description>LCD Pin 29 Back Plane Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_30_BPEN</name>
              <description>LCD Pin 30 Back Plane Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_31_BPEN</name>
              <description>LCD Pin 31 Back Plane Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
