nxp-mcuxpresso/mcux-soc-svd/MCXA186/MCXA186.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC0</name>
      <description>Real Time Clock</description>
      <groupName>RTC</groupName>
      <baseAddress>0x400EE000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>RTC_1HZ</name>
        <value>120</value>
      </interrupt>
      <registers>
        <register>
          <name>TSR</name>
          <description>RTC Time Seconds</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSR</name>
              <description>Time Seconds Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR</name>
          <description>RTC Time Prescaler</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPR</name>
              <description>Time Prescaler Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR</name>
          <description>RTC Time Alarm</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAR</name>
              <description>Time Alarm Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <description>RTC Time Compensation</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCR</name>
              <description>Time Compensation Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CYCLE_4</name>
                  <description>Time Prescaler Register overflows every 32768 clock cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLE_5</name>
                  <description>Time Prescaler Register overflows every 32767 clock cycles.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLE_6</name>
                  <description>Time Prescaler Register overflows every 32642 clock cycles.</description>
                  <value>0x7E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLE_7</name>
                  <description>Time Prescaler Register overflows every 32641 clock cycles.</description>
                  <value>0x7F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLE_1</name>
                  <description>Time Prescaler Register overflows every 32896 clock cycles.</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLE_2</name>
                  <description>Time Prescaler Register overflows every 32895 clock cycles.</description>
                  <value>0x81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLE_3</name>
                  <description>Time Prescaler Register overflows every 32769 clock cycles.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIR</name>
              <description>Compensation Interval Register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCV</name>
              <description>Time Compensation Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CIC</name>
              <description>Compensation Interval Counter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>RTC Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWR</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Resets all RTC registers except for the SWR bit . The SWR bit is cleared by POR and by software explicitly clearing it.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UM</name>
              <description>Update Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_WRITABLE</name>
                  <description>Registers cannot be written when locked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Registers can be written when locked under limited conditions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPOS</name>
              <description>LPO Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLOCK_32</name>
                  <description>RTC prescaler increments using 32.768 kHz clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_LPO</name>
                  <description>RTC prescaler increments using 16.384 kHz LPO. Bit [0] of the prescaler is ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>RTC Status</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIF</name>
              <description>Time Invalid Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Time is valid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Time is invalid and time counter is read as zero.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOF</name>
              <description>Time Overflow Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OVERFLOW</name>
                  <description>Time overflow has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERFLOW</name>
                  <description>Time overflow has occurred and time counter reads as zero.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAF</name>
              <description>Time Alarm Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ALARM</name>
                  <description>Time alarm has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALARM</name>
                  <description>Time alarm has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCE</name>
              <description>Time Counter Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LR</name>
          <description>RTC Lock</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCL</name>
              <description>Time Compensation Lock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Time Compensation Register is locked and writes are ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_LOCKED</name>
                  <description>Time Compensation Register is not locked and writes complete as normal.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRL</name>
              <description>Control Register Lock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Control Register is locked and writes are ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_LOCKED</name>
                  <description>Control Register is not locked and writes complete as normal.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRL</name>
              <description>Status Register Lock</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Status Register is locked and writes are ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_LOCKED</name>
                  <description>Status Register is not locked and writes complete as normal.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LRL</name>
              <description>Lock Register Lock</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Lock Register is locked and writes are ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_LOCKED</name>
                  <description>Lock Register is not locked and writes complete as normal.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>RTC Interrupt Enable</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIIE</name>
              <description>Time Invalid Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_INTRPT</name>
                  <description>No interrupt is generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRPT</name>
                  <description>An interrupt is generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOIE</name>
              <description>Time Overflow Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_INTRPT</name>
                  <description>No interrupt is generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRPT</name>
                  <description>An interrupt is generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAIE</name>
              <description>Time Alarm Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_INTRPT</name>
                  <description>No interrupt is generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRPT</name>
                  <description>An interrupt is generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSIE</name>
              <description>Time Seconds Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSIC</name>
              <description>Timer Seconds Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRQ_1</name>
                  <description>1 Hz.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ_2</name>
                  <description>2 Hz.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ_3</name>
                  <description>4 Hz.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ_4</name>
                  <description>8 Hz.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ_5</name>
                  <description>16 Hz.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ_6</name>
                  <description>32 Hz.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ_7</name>
                  <description>64 Hz.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ_8</name>
                  <description>128 Hz.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
